ADMIN = "7215866709"
GROUP = "@+q9h9_PU_4Xw4YTRi"

BANNED_WORDS_RUS = ["хуй", "сука", "бля", "пидор", "ебать", "блядь", "пизда", "манда", "елда", "малафья", "молофья",
                    "залупа", "дрочить", "минжа", "курва", "сперма", "гондон", "гандон", "менстра", "хер", "целка", "трах", "минет", "педераст", "педик", "нигер", "ниггер", "негр", "черномазый", "черножопый",
                    "кацап", "москаль", "русня", "харып", "мамбет", "гомик", "хохол", "жид", "пиндос", "чурка",
                    "хач", 'даун', "инцел", "симп", "девственник", "соска", "шлюха", "хуе", "хуя", "выёбываться",
                    "еба", "ёба", "fuck", "bitch", "shit", "cock", "suck", "dick", "пенис", "penis","дроч", "анал", "сиськи",
                    "мудила", "мудак", "пизд"]
BANNED_WORDS_ENG = ["bitch", "shit", "fuck", "cock", "crap", "dick", "pussy", "asshole", "cunt", "nigger", "nigga",
                    "cum", "penis", "whore", "fap", "wank", "anal", "hoe", "slut", 'tits', "bastard"]
