translation = {
    "а": ["a", "а", "@"],
    "б": ["б", "b", "6"],
    "в": ["в", "v"],
    "г": ["г", "g"],
    "д": ["д", "d"],
    "е": ["е", "e"],
    "ё": ["ё", "e", "е"],
    "ж": ["ж", "j"],
    "з": ["z", "з", "3"],
    "и": ["и", "й", "i"],
    "й": ["й", "y"],
    "к": ["к", "k"],
    "л": ["л", "l"],
    "м": ["м", "m"],
    "н": ["н", "n"],
    "о": ["о", "o", "0"],
    "п": ["п", "p"],
    "р": ["р", "p", "r"],
    "с": ["с", "c", "s"],
    "т": ["т", "t"],
    "у": ["у", "y"],
    "ф": ["ф", "f"],
    "х": ["x", "h", "х"],
    "ц": ["ц", "c"],
    "ч": ["ч"],
    "ш": ["ш"],
    "щ": ["щ"],
    "ъ": ["ъ"],
    "ы": ["ы"],
    "ь": ["ь"],
    "э": ["э", "€"],
    "ю": ["ю"],
    "я": ["я"],
    " ": [" "]
}

# message = ""
#
# reason_filter = message.split(" ")
# reason = " ".join(reason_filter)
#
# print(reason_filter)
# if reason == "":
#     print("BLANK")

from database.queries import *

# print(get_eng_story_del("Headline"))

BANNED_WORDS_RUS = ["хуй", "сука", "бля", "пидор", "ебать", "блядь", "пизда", "манда", "малафья", "дрочить", "минжа",
                    "сперма", "гондон", "гандон", "целка", "трах", "минет", "педик", "хуе", "хуя", "выёбываться",
                    "еба", "ёба", "fuck", "bitch", "shit", "cock", "suck", "dick",
                    "анал", "сиськи", "мудила", "мудак", "пизд", "хер"]

SWEAR_WORDS_RUS = ["хач", "харып", "мамбет", "хохол", "жид", "пиндос", "пендос", "чурка", "негр", "ниггер", "черножопый",
                   "черномазый", "кацап", "москаль", "русня", "шлюха", "проститутка"]

BANNED_WORDS_ENG = ["shit", "fuck", "cock", "crap", "dick", "pussy", "cunt",
                    "cum", "penis", "fap", "wank", "anal", 'tits']

SWEAR_WORDS_ENG = ["bitch", "asshole", "nigger", "nigga", "whore", "prostitute", "slut", "bastard", "hoe"]

print(get_chat_permissions(-1002226995046))